export const products = [
  {
    id: '1',
    name: 'Дегустаційний сет «Палітра смаку»',
    price: '1990 грн',
    image: 'https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_1024/https://honeytime.com.ua/wp-content/uploads/2023/03/koshyk-2--e1679049413956-1024x1024.jpg',
    opisanie: 'Великий сирний сет для найповнішої дегустації. У наборі 14 видів різних за смаком та текстурою сирів. Коровʼячі, козині, овечі та навіть з молока буйволиць. + пʼянкий напій',
    category:'Сир'
  },
  {
    id: '2',
    name: 'Набір цукерок Капсула часу',
    price: '1 799 грн',
    image: 'https://spellchocolate.com/image/cache/catalog/product/seti/katalog_candy_box_new1413-1200x1200%281%29-600x600.png',
    opisanie:'Ти тримаєш у руках цукерки з нової колекції Spell "Капсула часу", що поєднали Spell, з яких все починалося 7 років тому з новими сенсами. Незвичайні комбінації інгредієнтів, експерименти з дизайном і текстурою та виразні смаки, що глибоко змінюють стан з першого шматочку. Тут і смак квітки гібіскуса у поєднанні з бренді, і марципан з бобами тонка, і смак кави з віскі в шоколаді.',
    category:'Цукерки'
  },
  {
    id: '3',
    name: 'Подарунковий набір чаю Перлини Дракона Пуер Шен 18 шт',
    price: '549 грн',
    image: 'https://ch.od.ua/image/cachewebp/cache/catalog/podarochnyj_nabor/zhemchug_18/zhemchug_drakona_nabor-855x855_0.webp',
    opisanie:'Цей елегантний подарунковий набір стане справжньою знахідкою для усіх, хто цінує витонченість китайських чайних традицій. Він прекрасно підійде в якості презенту на будь-яку урочистість: день народження, новосілля або корпоративне свято. Особливий акцент на естетиці та користі робить його ідеальним подарунком для тих, хто любить насолоджуватися чаєм з глибокою історією і насиченим смаком.',
    category:'Чай'
  },
  {
    id: '4',
    name: 'Чашка з відбитками справжніх рослин',
    price: '410 грн',
    image: 'https://nd-ukraine.com/storage/6023/thumb-chapter-products-20190318-105732-155289945221_605_767.webp',
    opisanie:'Насолоджуйтесь улюбленим напоєм у чашці, що поєднує в собі природну красу та унікальність. Кожна чашка декорована справжніми рослинами, відбитими вручну, що робить кожен виріб неповторним. Витончені форми листя, квітів чи трав передають настрій природи й додають тепла до щоденних ритуалів.',
    category:'Чашка'
  }
];

export const categories = [...new Set(products.map(p => p.category))];
export const news = [
  {
    id: '1',
    title: 'Новий завіз крафтових свічок',
    short: 'До нас приїхала нова партія ароматичних свічок...',
    full: 'До нас приїхала нова партія ароматичних свічок з Франції. Усі вони виготовлені вручну з натурального воску...'
  },
  {
    id: '2',
    title: 'Знижки на деревʼяний посуд!',
    short: 'Лише цього тижня — знижки до 30% на весь деревʼяний посуд...',
    full: 'Лише цього тижня — знижки до 30% на весь деревʼяний посуд. Пропозиція діє до неділі включно...'
  }
];
